// Поставьте звёздочку проекту на GitHub, чтобы поддержать его!
#include <iostream>
#include <print>

using namespace std;

int main() {
    double x{}, y{}, z{};
    println("Введите x,y,z(через пробел): ");
    cin >> x >> y >> z;

    bool exists = (x + y > z) && (x + z > y) && (y + z > x);
    //геометрическая фигура существует только тогда, когда длина любой стороны меньше суммы двух других.
    if (!exists) {
        println("Треугольник не существует.");
        return 0;
    }

    bool is_acute = (x * x + y * y > z * z) && (x * x + z * z > y * y) && (y * y + z * z > x * x);
    // логическое условие остроугольности по теореме косинусов: сумма квадратов любых двух сторон должна быть строго больше квадрата третьей стороны
    if (is_acute) {
        println("Исходные данные: x = {}, y = {}, z = {}", x, y, z);
        println("Ожидаемый результат: треугольник существует и он остроуголен.");
    }
    else {
        println("Исходные данные: x = {}, y = {}, z = {}", x, y, z);
        println("Ожидаемый результат: треугольник существует и он не остроуголен.");
    }

}
// Поставьте звёздочку проекту на GitHub, чтобы поддержать его!
